package uiautomator;

public class Const {
    public final static String AGENCY_NAME = "official";
    public final static String DUMPSYS_PACKAGE_SIG_HASH = "68cf7ff5";
    public final static String USER_AGREEMENT =
            "亲爱的用户, 在您阅读本声明后若不同意此声明中的任何条款，或对本声明存在质疑，请立刻停止使用软件。若您正在使用软件，则表示您已阅读并同意本声明的所有条款之约定。任何单位或个人不得在没有团队授权的情况下对旗下软件进行二次开发、功能修改和反编译。开发者保留版权与著作权。\n" +
                    "1.本软件经过详细的测试，但不能保证与所有的软硬件系统完全兼容，不能保证本软件完全没有错误。如果出现不兼容及软件错误的情况，用户可通过官方网站联系到开发者，获得技术支持。\n" +
                    "2.使用本软件产品风险由用户自行承担，在适用法律允许的最大范围内，包括但不限于直接或间接的个人损害、商业赢利的丧失、贸易中断、商业信息的丢失或任何其它经济损失，作者不承担任何责任。\n" +
                    "3.用户违反本协议规定，对软件开发与发行方造成损害的。软件开发与发行方有权采取包括但不限于中断使用许可、停止提供服务、限制使用、法律追究等措施。不得使用本软件发布操作违反国家法律的非法广告信息，如色情，赌博, 软件拉新进行谋利的，非法注册各大平台账户等，其造成的一切后果与作者无关，请自觉营造和谐良性的网络营销环境。\n" +
                    "4.同意本协议即代表对本认识有清晰对认识，对使用本软件造成任何行为开发者不负责任。\n" +
                    "5.软件某些功能需要向开发者申请授权方可使用。";

    public final static String PRIVACY_AGREEMENT = "" +
            "我们深知用户信息对您的重要性，并会尽全力保护您的用户信息安全可靠。我们致力于维持您对我们的信任，恪守以下原则，保护您的用户信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。同时，我们承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的用户信息。\n" +
            "请在使用我们的产品（或服务）前，仔细阅读并了解本隐私政策。\n" +
            "\n" +
            "一、我们如何收集和使用您的用户信息\n" +
            "（一）您使用我司产品或服务过程中我们收集和使用的信息\n" +
            "我们仅会出于本政策所述的业务功能，收集和使用您的用户信息，收集用户信息的目的在于向您提供产品或服务，您有权自行选择是否提供该信息，但多数情况下，如果您不提供，我们可能无法向您提供相应的服务，也无法回应您遇到的问题：\n" +
            "在您使用我们的服务时，允许我们收集您自行向我们提供的或为向您提供服务所必要的信息包括：网络日志、设备信息、位置信息和其它相关信息等。\n" +
            "对于我们收集的用户信息，我们将用于为您提供身份验证、安全防范、反诈骗监测、存档备份、客户的安全服务等用途。[（重要）为保证隐私政策的规范性，建议逐项描述应用所收集和使用的用户信息，逐项说明收集该信息具体的使用目的和使用方式。\n" +
            "]\n" +
            "您提供的上述信息，将在您使用本服务期间持续授权我们使用。在您停止使用推送服务时，我们将停止使用并删除上述信息。\n" +
            "我们保证会依法对收集后的用户信息进行去标识化或匿名化处理，对于无法单独或者与其他信息结合识别自然人个人身份的信息，不属于法律意义上的个人信息。如果我们将非个人信息与其他信息结合识别到您的个人身份时，或者与您的个人信息结合使用时，我们会在结合使用期间，将此类信息作为您的个人信息按照本隐私政策对其进行处理和保护。\n" +
            "为了更好运营和改善我们的技术和服务，或出于商业策略的变化，当我们提供的产品或服务所需的用户信息收集、使用、处理超出上述范围或者要将收集到的用户信息用于本隐私政策未载明的其他用途，或当我们要将基于特定目的收集而来的信息用于其他目的时，我们会在获取用户信息后的合理期限内或处理用户信息前通知您，并获得您的授权同意。\n" +
            "\n" +
            "（二）征得授权同意的例外\n" +
            "请您理解，根据法律法规及相关国家标准，以下情形中，我们收集和使用您的用户信息无需征得您的授权同意： \n" +
            "1、与国家安全、国防安全直接相关的； \n" +
            "2、与公共安全、公共卫生、重大公共利益直接相关的； \n" +
            "3、与犯罪侦查、起诉、审判和判决执行等直接相关的； \n" +
            "4、出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的； \n" +
            "5、所收集的您的用户信息是您自行向社会公众公开的；\n" +
            "6、从合法公开披露的信息中收集的您的用户信息，如合法的新闻报道、政府信息公开等渠道； \n" +
            "7、根据您的要求签订或履行合同所必需的； \n" +
            "8、用于维护软件及相关服务的安全稳定运行所必需的，例如发现、处置软件及相关服务的故障；\n" +
            "9、 个人信息控制者为新闻单位且其在开展合法的新闻报道所必需的； \n" +
            "10、学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的。\n" +
            "11、法律法规规定的其他情形。" + "\n" +
            "（二）我们会收集需要何种权限以及作用：\n" +
            "1.存储读写权限\tsdcard的脚本工程管理\n" +
            "2.后台弹出界面\t应用运行在后台时候toast 文字提示脚本运行情况\n" +
            "3.通知提示/通知常驻\t迷你脚本工程控制窗口，脚本工程运行情况通知\n" +
            "4.IMEI收集 以md5的形式保存,注册激活时候需要认定唯一设备。" + "\n" +
            "5.root权限 激活引擎，以使用点击，截图等自动化功能";

    public final static String ACTIVE_KEY_FILE = "/sdcard/Yyds.Auto/.b1";

    public final static String CONFIG_USE_KERNEL_CLICK = "/data/local/tmp/config.kernel_touch";

    public final static String YY_INPUT_METHOD_ID = "com.yyds.auto/common.YyInputService";

    public final static String NAV_TO_ACTIVITY_FRAGMENT = "NAV_TO_ACTIVITY_FRAGMENT";


}
